Autodesk.Revit.DB.CurtainGridSet
A set that can contain any type of object.

Autodesk.Revit.DB.CurtainGridSet.Insert(System.Object)
System.Int32
Insert the specified item into the set.
item: The item to be inserted into the set.
Returns: Returns whether the item was inserted into the set.

Autodesk.Revit.DB.CurtainGridSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CurtainGridSet.ReverseIterator
Autodesk.Revit.DB.CurtainGridSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.CurtainGridSet.ForwardIterator
Autodesk.Revit.DB.CurtainGridSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.CurtainGridSet.Erase(System.Object)
System.Int32
Removes a specified object from the set.
item: The item to be erased.
Returns: The number of items that were erased from the set.

Autodesk.Revit.DB.CurtainGridSet.Contains(System.Object)
System.Boolean
Tests for the existence of an item within the set.
item: The item to be searched for.
Returns: The Contains method returns True if the item is within the set, otherwise False.

Autodesk.Revit.DB.CurtainGridSet.Clear
void
Removes every item from the set, rendering it empty.

Autodesk.Revit.DB.CurtainGridSet.Size
System.Int32
get
Returns the number of objects that are in the set.

Autodesk.Revit.DB.CurtainGridSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.